public class Lesson_75_SpringDataJPA {
    // Итак, мы создали новый проект, в этот раз мы при создании добавили Spring Data JPA и полностью
    // скопировали все пакеты.
    // Однако теперь будут СУЩЕСТВЕННЫЕ отличия. Нам не надо описывать логику нашего приложения.
    // Совсем. Spring будет делать все сам в соответствии с правильными названиями методов.
    // То есть нам надо удалить все классы имплементации. Начнем с интерфейса EmployeeDAO лежащего
    // в пакете service.dao, перейдем в него
}
